{"modelTopology":{"class_name":"Model","config":{"name":"my_auto-mpg_model","layers":[{"name":"nnv_Input","class_name":"InputLayer","config":{"batch_input_shape":[null,9],"dtype":"float32","sparse":false,"name":"nnv_Input"},"inbound_nodes":[]},{"name":"nnv_Dense_1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Dense_1","trainable":true},"inbound_nodes":[[["nnv_Input",0,0,{}]]]},{"name":"nnv_Output","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Output","trainable":true},"inbound_nodes":[[["nnv_Dense_1",0,0,{}]]]}],"input_layers":[["nnv_Input",0,0]],"output_layers":[["nnv_Output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"nnv_Dense_1/kernel","shape":[9,64],"dtype":"float32"},{"name":"nnv_Dense_1/bias","shape":[64],"dtype":"float32"},{"name":"nnv_Output/kernel","shape":[64,1],"dtype":"float32"},{"name":"nnv_Output/bias","shape":[1],"dtype":"float32"}]}]}