{"modelTopology":{"class_name":"Functional","config":{"name":"imdb-model","layers":[{"name":"input_layer","class_name":"InputLayer","config":{"batch_input_shape":[null,200],"dtype":"float32","sparse":false,"name":"input_layer"},"inbound_nodes":[]},{"name":"embedding","class_name":"Embedding","config":{"input_dim":20000,"output_dim":32,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false,"input_length":null,"name":"embedding","trainable":true,"batch_input_shape":[null,null],"dtype":"float32"},"inbound_nodes":[[["input_layer",0,0,{}]]]},{"name":"position_embedding","class_name":"PositionEmbedding","config":{"name":"position_embedding","trainable":true,"sequence_length":200,"initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}}},"inbound_nodes":[[["embedding",0,0,{}]]]},{"name":"add","class_name":"Add","config":{"name":"add","trainable":true},"inbound_nodes":[[["embedding",0,0,{}],["position_embedding",0,0,{}]]]},{"name":"global_average_pooling1d","class_name":"GlobalAveragePooling1D","config":{"name":"global_average_pooling1d","trainable":true},"inbound_nodes":[[["add",0,0,{}]]]},{"name":"dropout","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout","trainable":true},"inbound_nodes":[[["global_average_pooling1d",0,0,{}]]]},{"name":"dense","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense","trainable":true},"inbound_nodes":[[["dropout",0,0,{}]]]},{"name":"dropout_1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_1","trainable":true},"inbound_nodes":[[["dense",0,0,{}]]]},{"name":"dense_1","class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_1","trainable":true},"inbound_nodes":[[["dropout_1",0,0,{}]]]}],"input_layers":[["input_layer",0,0]],"output_layers":[["dense_1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"embedding/embeddings","shape":[20000,32],"dtype":"float32"},{"name":"position_embedding/embeddings","shape":[200,32],"dtype":"float32"},{"name":"dense/kernel","shape":[32,32],"dtype":"float32"},{"name":"dense/bias","shape":[32],"dtype":"float32"},{"name":"dense_1/kernel","shape":[32,2],"dtype":"float32"},{"name":"dense_1/bias","shape":[2],"dtype":"float32"}]}]}