{"modelTopology":{"class_name":"Sequential","config":{"name":"my_fashion-mnist_model","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,28,28,1],"dtype":"float32","sparse":false,"name":"nnv_InputLayer_0"}},{"class_name":"Flatten","config":{"name":"flatten_Flatten12","trainable":true}},{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Dense_1","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Output","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"nnv_Dense_1/kernel","shape":[784,64],"dtype":"float32"},{"name":"nnv_Dense_1/bias","shape":[64],"dtype":"float32"},{"name":"nnv_Output/kernel","shape":[64,10],"dtype":"float32"},{"name":"nnv_Output/bias","shape":[10],"dtype":"float32"}]}]}