{"modelTopology":{"class_name":"Sequential","config":{"name":"calif-0.789","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,8],"dtype":"float32","sparse":false,"name":"nnv_InputLayer_0"}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Dense_1","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Dense_2","trainable":true}},{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Dense_3","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"nnv_Output","trainable":true}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./weights.bin"],"weights":[{"name":"nnv_Dense_1/kernel","shape":[8,256],"dtype":"float32"},{"name":"nnv_Dense_1/bias","shape":[256],"dtype":"float32"},{"name":"nnv_Dense_2/kernel","shape":[256,128],"dtype":"float32"},{"name":"nnv_Dense_2/bias","shape":[128],"dtype":"float32"},{"name":"nnv_Dense_3/kernel","shape":[128,32],"dtype":"float32"},{"name":"nnv_Dense_3/bias","shape":[32],"dtype":"float32"},{"name":"nnv_Output/kernel","shape":[32,1],"dtype":"float32"},{"name":"nnv_Output/bias","shape":[1],"dtype":"float32"}]}]}